[
  {
    "id": "L01S001",
    "level": 1,
    "title": "Technology Consulting",
    "description": "Expertise in technology strategy, implementation, and digital transformation initiatives. Includes enterprise architecture, system integration, and emerging technology adoption.",
    "skills": [
      {
        "id": "L02S001",
        "level": 2,
        "title": "Digital Strategy",
        "description": "Strategic planning and roadmap development for digital transformation initiatives and technology adoption.",
        "skills": [
          { "id": "L03S001", "level": 3, "title": "Digital Transformation Planning", "description": "Developing comprehensive strategies for organizational digital transformation including technology roadmaps, change management, and ROI analysis." },
          { "id": "L03S002", "level": 3, "title": "Technology Architecture Design", "description": "Designing scalable technology architectures that support business objectives and enable future growth and innovation." },
          { "id": "L03S003", "level": 3, "title": "Innovation Strategy", "description": "Creating frameworks for continuous innovation, emerging technology evaluation, and digital product development strategies." },
          { "id": "L03S004", "level": 3, "title": "Digital Operating Model Design", "description": "Developing new operating models that leverage digital technologies to improve efficiency, agility, and customer experience." },
          { "id": "L03S005", "level": 3, "title": "Technology Vendor Assessment", "description": "Evaluating and selecting technology vendors, platforms, and solutions that align with strategic objectives and technical requirements." }
        ]
      },
      {
        "id": "L02S002",
        "level": 2,
        "title": "Cloud Solutions",
        "description": "Cloud platform architecture, migration strategies, and cloud-native application development and deployment.",
        "skills": [
          { "id": "L03S001", "level": 3, "title": "Cloud Migration Strategy", "description": "Planning and executing migration of legacy systems and applications to cloud platforms with minimal disruption and maximum efficiency." },
          { "id": "L03S002", "level": 3, "title": "Multi-Cloud Architecture", "description": "Designing and implementing solutions that span multiple cloud providers to optimize performance, cost, and risk management." },
          { "id": "L03S003", "level": 3, "title": "Cloud Security Implementation", "description": "Implementing comprehensive security frameworks for cloud environments including identity management, data protection, and compliance." },
          { "id": "L03S004", "level": 3, "title": "Cloud Cost Optimization", "description": "Analyzing and optimizing cloud resource usage and costs through monitoring, automation, and architectural improvements." },
          { "id": "L03S005", "level": 3, "title": "Serverless Architecture", "description": "Designing and implementing serverless solutions using functions-as-a-service and event-driven architectures for scalable applications." }
        ]
      }
    ]
  },
  {
    "id": "L01S002",
    "level": 1,
    "title": "Business Process Consulting",
    "description": "Optimization of business processes, workflow automation, and operational excellence initiatives to improve efficiency and effectiveness.",
    "skills": [
      {
  "id": "L02S001",
        "level": 2,
        "title": "Process Improvement",
        "description": "Analysis and optimization of existing business processes to eliminate waste, reduce costs, and improve quality.",
        "skills": [
          { "id": "L03S001", "level": 3, "title": "Lean Six Sigma Implementation", "description": "Applying Lean Six Sigma methodologies to identify inefficiencies, reduce waste, and improve process quality and performance." },
          { "id": "L03S002", "level": 3, "title": "Business Process Reengineering", "description": "Fundamental redesign of business processes to achieve dramatic improvements in performance, quality, and customer satisfaction." },
          { "id": "L03S003", "level": 3, "title": "Workflow Automation Design", "description": "Designing and implementing automated workflows using technology to streamline operations and reduce manual intervention." },
          { "id": "L03S004", "level": 3, "title": "Performance Metrics Development", "description": "Creating comprehensive performance measurement systems including KPIs, dashboards, and reporting frameworks." },
          { "id": "L03S005", "level": 3, "title": "Change Management", "description": "Managing organizational change initiatives including stakeholder engagement, communication strategies, and resistance management." }
        ]
      },
      {
        "id": "L02S002",
        "level": 2,
        "title": "Operations Excellence",
        "description": "Implementing operational excellence frameworks, quality management systems, and continuous improvement methodologies.",
        "skills": [
          { "id": "L03S001", "level": 3, "title": "Quality Management Systems", "description": "Implementing and maintaining quality management systems including ISO standards, quality audits, and continuous improvement processes." },
          { "id": "L03S002", "level": 3, "title": "Supply Chain Optimization", "description": "Optimizing supply chain operations including vendor management, inventory optimization, and logistics improvement initiatives." },
          { "id": "L03S003", "level": 3, "title": "Risk Management Framework", "description": "Developing comprehensive risk management frameworks including risk assessment, mitigation strategies, and compliance monitoring." },
          { "id": "L03S004", "level": 3, "title": "Customer Experience Optimization", "description": "Improving customer experience through journey mapping, touchpoint optimization, and customer feedback integration." },
          { "id": "L03S005", "level": 3, "title": "Data-Driven Decision Making", "description": "Implementing analytics and reporting systems to support evidence-based decision making and performance monitoring." }
        ]
      }
    ]
  },
  {
    "id": "L01S003",
    "level": 1,
    "title": "Data Analytics & Intelligence",
    "description": "Advanced analytics, business intelligence, machine learning, and data science capabilities to drive insights and business value.",
    "skills": [
      {
  "id": "L02S001",
        "level": 2,
        "title": "Business Intelligence",
        "description": "Development and implementation of business intelligence solutions including data warehousing, reporting, and visualization.",
        "skills": [
          { "id": "L03S001", "level": 3, "title": "Data Warehouse Design", "description": "Designing and implementing enterprise data warehouses including dimensional modeling, ETL processes, and data governance frameworks." },
          { "id": "L03S002", "level": 3, "title": "Advanced Analytics Reporting", "description": "Creating sophisticated reporting solutions with interactive dashboards, automated insights, and self-service analytics capabilities." },
          { "id": "L03S003", "level": 3, "title": "Data Visualization Strategy", "description": "Developing comprehensive data visualization strategies including tool selection, design standards, and user experience optimization." },
          { "id": "L03S004", "level": 3, "title": "Performance Analytics", "description": "Implementing performance analytics solutions to track, measure, and improve business KPIs and operational metrics." },
          { "id": "L03S005", "level": 3, "title": "Predictive Analytics", "description": "Developing predictive models and forecasting solutions to anticipate trends, behaviors, and business outcomes." }
        ]
      },
      {
        "id": "L02S002",
        "level": 2,
        "title": "Machine Learning & AI",
        "description": "Implementation of machine learning algorithms, artificial intelligence solutions, and advanced data science techniques.",
        "skills": [
          { "id": "L03S001", "level": 3, "title": "Machine Learning Model Development", "description": "Developing, training, and deploying machine learning models for classification, regression, clustering, and recommendation systems." },
          { "id": "L03S002", "level": 3, "title": "Natural Language Processing", "description": "Implementing NLP solutions for text analysis, sentiment analysis, chatbots, and automated content generation." },
          { "id": "L03S003", "level": 3, "title": "Computer Vision Solutions", "description": "Developing computer vision applications for image recognition, object detection, and automated visual inspection systems." },
          { "id": "L03S004", "level": 3, "title": "AI Ethics and Governance", "description": "Implementing responsible AI practices including bias detection, fairness assessment, and ethical AI governance frameworks." },
          { "id": "L03S005", "level": 3, "title": "MLOps Implementation", "description": "Implementing machine learning operations including model versioning, automated testing, deployment pipelines, and monitoring systems." }
        ]
      }
    ]
  }
]